#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
cloudflare_record.subdomain["transmission"]: Refreshing state... [id=518b006a54c1e51cf02e8dc6814b32a5]
cloudflare_r2_bucket.rpi_k8s: Refreshing state... [id=rpi-k8s-backup]
cloudflare_record.subdomain["portainer"]: Refreshing state... [id=2a61df6a6d251a3c2328655201e7414e]
cloudflare_record.subdomain["jellyfin"]: Refreshing state... [id=d6961c47e5498aa167ade9921d70633c]
cloudflare_record.subdomain["compartilhado"]: Refreshing state... [id=947075e16043f5d4304c6f629a1eafa3]
cloudflare_record.subdomain["wyl"]: Refreshing state... [id=7047c69fb3616e149cc06f6763b04e0a]
cloudflare_record.subdomain["sonar"]: Refreshing state... [id=b9e3721c88d0030f4c1a3b6c08726824]
cloudflare_record.subdomain["kuma"]: Refreshing state... [id=4591a207e64cffc871a4e1d2a30776c3]
cloudflare_record.subdomain["tandoor"]: Refreshing state... [id=e9faa368c40c6c149b5e9e861d8243a5]
cloudflare_record.subdomain["actual"]: Refreshing state... [id=7f5e203b4df7a1448b9d52b2693461c9]
cloudflare_record.subdomain["radar"]: Refreshing state... [id=33a5ff8cb15f1c8b9163311ba4ba7aa8]
cloudflare_record.subdomain["bazar"]: Refreshing state... [id=12d84f35a54d58ade7bf10a8d4c37708]
cloudflare_record.subdomain["readar"]: Refreshing state... [id=ddc3a7ac827e70fad2a5caa7f3b1c574]
cloudflare_record.subdomain["npm"]: Refreshing state... [id=256e086a602ec5285bdc9a26f17a0479]
cloudflare_record.subdomain["minio-data"]: Refreshing state... [id=ba10f77390ec8f166bc0d1c6a35b5dbd]
cloudflare_record.subdomain["sabnzbd"]: Refreshing state... [id=d9e895506c7f6aa6dd9bd62788eb9f00]
cloudflare_record.subdomain["minio"]: Refreshing state... [id=01c4096ebafd384cf361c0584f35827b]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.subdomain["jellyseerr"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "jellyseerr.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["n8n"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "n8n.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @guilhermewolf, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Plan`*